ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/TIMG2_1.0.xml
        <register id="TIMG2_CPS" width="32" offset="0xC" description="Clock Prescale Register">
            <bitfield id="PCNT" description="Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG2_CPSV" width="32" offset="0x10" description="Clock prescale count status register">
            <bitfield id="CPSVAL" description="Current Prescale Count Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG2_CTTRIGCTL" width="32" offset="0x14" description="Timer Cross Trigger Control Register">
            <bitfield id="CTEN" description="Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTEN" description="Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTTRIGSEL" description="Used to Select the subscriber port that should be used for input cross trigger." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="FSUB0" value="0x0" description="Use FSUB0 as cross trigger source."/>
                <bitenum id="FSUB1" value="0x1" description="Use FSUB1 as cross trigger source."/>
                <bitenum id="Z" value="0x2" description="Use Zero event  as cross trigger source."/>
                <bitenum id="L" value="0x3" description="Use Load event as cross trigger source."/>
                <bitenum id="CCD0" value="0x4" description="Use CCD0 event  as cross trigger source."/>
                <bitenum id="CCD1" value="0x5" description="Use CCD1 event  as cross trigger source."/>
                <bitenum id="CCD2" value="0x6" description="Use CCD2 event  as cross trigger source."/>
                <bitenum id="CCD3" value="0x7" description="Use CCD3 event  as cross trigger source."/>
                <bitenum id="CCU0" value="0x8" description="Use CCU0 event  as cross trigger source."/>
                <bitenum id="CCU1" value="0x9" description="Use CCU1 event  as cross trigger source."/>
                <bitenum id="CCU2" value="0xA" description="Use CCU2 event  as cross trigger source."/>
                <bitenum id="CCU3" value="0xB" description="Use CCU3 event  as cross trigger source."/>
            </bitfield>
        </register>
        <register id="TIMG2_CTTRIG" width="32" offset="0x1C" description="Timer Cross Trigger Register">
            <bitfield id="TRIG" description="Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled"/>
                <bitenum id="GENERATE" value="0x1" description="Generate Cross trigger pulse"/>
            </bitfield>
        </register>
        <register id="TIMG2_FSCTL" width="32" offset="0x20" description="Fault Source Control">
            <bitfield id="FCEN" description="This field controls whether the fault is caused by the system clock fault." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC0EN" description="This field controls whether the fault signal is caused by COMP0 output." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC1EN" description="This field controls whether the fault is caused by COMP1 output." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FAC2EN" description="This field controls whether the fault is caused by COMP2 output." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX0EN" description="This field controls whether the fault is caused by external fault pin 0." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX1EN" description="This field controls whether the fault is caused by external fault pin 1." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
            <bitfield id="FEX2EN" description="This field controls whether the fault is caused by external fault pin 2." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable"/>
                <bitenum id="ENABLE" value="0x1" description="Enable"/>
            </bitfield>
        </register>
